Revit 2027 API
FormArray.Item Property
Gets or sets a form at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Form this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Form
	Get
	Set
public:
virtual property Form^ Item[int index] {
	Form^ get (int index);
	void set (int index, Form^ value);
}
abstract Item : Form with get, set
override Item : Form with get, set
Parameters
index Int32
The index of the form to be set or retrieved.
Return Value
Form
Returns the form at the specified index.
See Also
Reference
FormArray Class
Autodesk.Revit.DB Namespace